Tekla Open API Reference for Tekla Structures 2025
TeklaProgressBar Class
The TeklaProgressBar class represents the common progress bar control for the Open API.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.TeklaProgressBar
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class TeklaProgressBar : Form
Public Class TeklaProgressBar
	Inherits Form
The TeklaProgressBar type exposes the following members.
Constructors
Name | Description
TeklaProgressBar
Initializes the common progress bar control.
Top
Properties
Name | Description
Text
Gets or sets the current message text of the progress bar.
Value
Gets or sets the current position of the progress bar.
Top
Events
Name | Description
CancelClicked
The CancelClicked event is raised when the cancel button is clicked.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace